love
sex
tiger
cat
book
paper
computer
keyboard
internet
plane
car
train
telephone
communication
television
radio
media
drug
abuse
bread
butter
cucumber
potato
doctor
nurse
professor
student
smart
stupid
company
stock
market
phone
CD
jaguar
egg
fertility
live
life
library
bank
money
wood
forest
cash
king
cabbage
queen
rook
bishop
rabbi
Jerusalem
Israel
Palestinian
holy
fuck
Maradona
football
soccer
basketball
tennis
racket
Arafat
peace
terror
Jackson
law
lawyer
movie
star
popcorn
critic
theater
physics
proton
chemistry
space
alcohol
vodka
gin
brandy
drink
ear
mouth
eat
baby
mother
automobile
gem
jewel
journey
voyage
boy
lad
coast
shore
asylum
madhouse
magician
wizard
midday
noon
furnace
stove
food
fruit
bird
cock
crane
tool
implement
brother
monk
oracle
cemetery
woodland
rooster
hill
graveyard
slave
chord
smile
glass
string
dollar
currency
wealth
property
possession
deposit
withdrawal
laundering
operation
feline
carnivore
mammal
animal
organism
fauna
zoo
psychology
psychiatry
anxiety
fear
depression
clinic
Freud
mind
health
science
discipline
cognition
planet
constellation
moon
sun
galaxy
astronomer
precedent
example
information
collection
group
antecedent
cup
coffee
tableware
article
artifact
object
entity
substance
liquid
energy
secretary
senate
laboratory
weapon
secret
FBI
fingerprint
investigation
effort
Mars
water
scientist
news
report
canyon
landscape
image
surface
discovery
seepage
sign
recess
Wednesday
mile
kilometer
territory
atmosphere
president
medal
war
troops
record
number
skin
eye
Japanese
American
history
volunteer
motto
prejudice
recognition
decoration
valor
century
year
nation
delay
racism
minister
party
plan
minority
attempt
government
crisis
deployment
departure
announcement
stroke
hospital
disability
death
victim
emergency
treatment
recovery
journal
association
personnel
liability
insurance
school
center
reason
hypertension
criterion
hundred
percent
Harvard
Yale
infrastructure
row
inmate
evidence
term
word
similarity
board
recommendation
governor
interview
OPEC
country
travel
activity
competition
price
consumer
confidence
problem
airport
flight
credit
card
hotel
reservation
grocery
registration
arrangement
accommodation
month
type
kind
arrival
bed
closet
clothes
situation
conclusion
isolation
impartiality
interest
direction
combination
street
place
avenue
block
children
listing
proximity
category
cell
production
hike
benchmark
index
trading
gain
dividend
payment
calculation
computation
oil
warning
profit
loss
yen
buck
software
network
hardware
equipment
maker
luxury
five
investor
earning
baseball
season
game
victory
team
marathon
sprint
series
defeat
seven
seafood
sea
lobster
wine
preparation
video
archive
start
match
round
boxing
championship
tournament
fighting
defeating
line
day
summer
drought
nature
dawn
environment
ecology
man
woman
murder
manslaughter
soap
opera
performance
lesson
focus
crew
film
lover
quarrel
viewer
serial
possibility
girl
population
development
morality
importance
marriage
Mexico
Brazil
gender
equality
change
attitude
family
planning
industry
sugar
approach
practice
institution
ministry
culture
challenge
size
prominence
citizen
people
issue
experience
music
project
metal
aluminum
chance
credibility
exhibit
memorabilia
concert
virtuoso
rock
jazz
museum
observation
architecture
world
preservation
admission
ticket
shower
thunderstorm
flood
weather
forecast
disaster
area
office
